In [2]:
import numpy as np
import pandas as pd

In [3]:
data = pd.read_csv('exp_3.csv')
print(data)

      name  age gender  marks
0      Jai   17      M   90.0
1   Gaurav   18      M    NaN
2   Princi   17      F   76.0
3     Anuj   17      M   74.0
4     Ravi   18      M   65.0
5  Natasha   17      F    NaN
6     Riya   17      F   71.0

In [4]:
df = pd.DataFrame(data)
df

      name  age gender  marks
0      Jai   17      M   90.0
1   Gaurav   18      M    NaN
2   Princi   17      F   76.0
3     Anuj   17      M   74.0
4     Ravi   18      M   65.0
5  Natasha   17      F    NaN
6     Riya   17      F   71.0

In [5]:
avg = print(df.mean(numeric_only= True))

age      17.285714
marks    75.200000
dtype: float64

In [6]:
df["marks"].fillna("75.2" , inplace = True)
df

      name  age gender marks
0      Jai   17      M  90.0
1   Gaurav   18      M  75.2
2   Princi   17      F  76.0
3     Anuj   17      M  74.0
4     Ravi   18      M  65.0
5  Natasha   17      F  75.2
6     Riya   17      F  71.0

In [7]:
df['gender'] = df['gender'].map({'M':0,'F':1,}).astype(float)

df

      name  age  gender marks
0      Jai   17     0.0  90.0
1   Gaurav   18     0.0  75.2
2   Princi   17     1.0  76.0
3     Anuj   17     0.0  74.0
4     Ravi   18     0.0  65.0
5  Natasha   17     1.0  75.2
6     Riya   17     1.0  71.0

In [8]:
df = df[df['marks'].astype(float)>= 75.0].copy()

df.drop('age',axis=1,inplace=True)

df

      name  gender marks
0      Jai     0.0  90.0
1   Gaurav     0.0  75.2
2   Princi     1.0  76.0
5  Natasha     1.0  75.2

In [9]:
import pandas as pd

details = pd.DataFrame({
    'ID':[101,102,103,104,105,106,107,108,109,110],
    'NAME':['Jagroop','Praveen','Harjot','Pooja','Rahul','Nikita','Saurabh','Ayush','Dolly','Mohit'],
    'BRANCH':['CSE','CSE','CSE','CSE','CSE','CSE','CSE','CSE','CSE','CSE']
    
})

print(details)

    ID     NAME
0  101  Jagroop
1  102  Praveen
2  103   Harjot
3  104    Pooja
4  105    Rahul
5  106   Nikita
6  107  Saurabh
7  108    Ayush
8  109    Dolly
9  110    Mohit

In [10]:
import pandas as pd 
fees_status = pd.DataFrame(
{'ID':[101,102,103,104,105,106,107,108,109,110],
'PENDING':['5000','250','NIL','9000','15000','NIL','4500','18000','250','NIL']})

print(fees_status)

    ID PENDING
0  101    5000
1  102     250
2  103     NIL
3  104    9000
4  105   15000
5  106     NIL
6  107    4500
7  108   18000
8  109     250
9  110     NIL

In [11]:
import pandas as pd

details = pd.DataFrame({
    'ID':[101,102,103,104,105,106,107,108,109,110],
    'NAME':['Jagroop','Praveen','Harjot','Pooja','Rahul','Nikita','Saurabh','Ayush','Dolly','Mohit']
    
})

import pandas as pd 
fees_status = pd.DataFrame(
{'ID':[101,102,103,104,105,106,107,108,109,110],
'PENDING':['5000','250','NIL','9000','15000','NIL','4500','18000','250','NIL']})

print(pd.merge(details,fees_status,on = 'ID'))

    ID     NAME PENDING
0  101  Jagroop    5000
1  102  Praveen     250
2  103   Harjot     NIL
3  104    Pooja    9000
4  105    Rahul   15000
5  106   Nikita     NIL
6  107  Saurabh    4500
7  108    Ayush   18000
8  109    Dolly     250
9  110    Mohit     NIL